#  ================================================ FACTOR ================================================  
#   +++++++++++++ 팩터란 무엇인가? +++++++++++++
#     용어 : 범주 = 레벨 = 카테고리 
#   범주형 : 데이터를 저장하는 데이터 구조
#   정해진 범주 내에서 카테고리별로 데이터를 분석하기 위한 구조 
#   예)
#     혈액형 (A,AB,B,O)  , 성별 (Female,Male)
sex <- factor(c("M","W","M","M","W","M","M","W","M","M","W","M"), levels=c("M","W"))
sex

levels(sex)

nlevels(sex)


# ============================ HOMEWORK ============================
  hw_bloodType <- factor(c("B","B","AB","O","B","O") , levels = c("A","B","AB","O"))
  hw_bloodType

  
  size <- factor(c("S","S","S","M","M","XL") , levels = c("S","M","L","XL"))
  size
  
  
  